<div class="b-quote">
    <div class="b-quote__content">
        <div class="b-quote__name">
            Комплексная диагностика и лечение височно-нижнечелюстного сустава от <strong>экспертной команды гнатологов</strong>
        </div>
        <div class="b-quote__content-text">
            <p>
                <strong>Здоровье височно-нижнечелюстного сустава требует не догадок, а математической точности.</strong> В нашем Центре мы подходим к диагностике экспертно: с помощью КТ мы видим структуру костных тканей, а электромиография (ЭМГ) позволяет нам оценить реальную работу мышц. Перенося данные в артикулятор, мы воссоздаем индивидуальную биомеханику вашего челюстного аппарата.
            </p>
            <p>
                Лечение — это всегда путь от разгрузки к восстановлению. Мы успешно применяем сплинт-терапию для настройки правильного смыкания и, при необходимости, проводим артролаваж — малоинвазивное «промывание» сустава, которое быстро возвращает ему подвижность и устраняет боль».
            </p>
        </div>
        <div class="b-quote__author">
            <a href="/kryga-evgeniy-aleksandrovich/" class="b-quote__author-name">
                Крыга Евгений Александрович
            </a>
            <div class="b-quote__author-text">Стоматолог-ортопед, гнатолог</div>
        </div>
    </div>
    <div class="b-quote__avatar">
        <img src="<?php echo get_template_directory_uri(); ?>/img/gnatologiya/kryga-quote.png" alt="Крыга Евгений Александрович" decoding="async" loading="lazy">
    </div>
</div>